{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:/Users/Owner/OneDrive/Documents/Georgetown University/Thesis Writer/Research/QB Worth/Season Analysis/Do 17 Season Bootstrap Baseline Sqrt.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}11 Sep 2025, 13:05:24
{com}. {c )-}
{txt}
{com}. 
. set more off
{txt}
{com}. timer clear 1
{txt}
{com}. timer on 1
{txt}
{com}. 
. * Season-level data
. use "C:/Users/Owner/OneDrive/Documents/Georgetown University/Thesis Writer/Research/QB Worth/Season Analysis/Data 11 Season Merge.dta", replace
{txt}
{com}. if `SeasonFlag' == 1 {c -(}
.         keep if Season < 2018
. {c )-}
{txt}
{com}. else if `SeasonFlag' == 2 {c -(}
.         keep if Season >= 2018
. {c )-}
{txt}
{com}. local CoYFlag = 0
{txt}
{com}. local End = 21+`CoYFlag'
{txt}
{com}. 
. * Count observations
. count
  {res}448
{txt}
{com}. local Reps = 500
{txt}
{com}. local Progress = 50
{txt}
{com}. set seed 72
{txt}
{com}. 
. * 2011 Indianapolis Colts missing Vegas Wins O/U
. gen MissWinTotal = 0
{txt}
{com}. replace MissWinTotal = 1 if WinTotal == .
{txt}(1 real change made)

{com}. label variable MissWinTotal MissWinTotal
{txt}
{com}. order MissWinTotal, after(WinTotal)
{txt}
{com}. quietly sum WinTotal
{txt}
{com}. local MeanWinTotal = r(mean)
{txt}
{com}. replace WinTotal = `MeanWinTotal' if WinTotal == .
{txt}(1 real change made)

{com}. 
. * Generate Fixed Effects
. sort Team Season
{txt}
{com}. local NObs = _N
{txt}
{com}. gen FE = 1
{txt}
{com}. forvalues i = 2/`NObs' {c -(}
{txt}  2{com}.         quietly replace FE in `i' = FE[`i'-1] if Team[`i'] == Team[`i'-1]
{txt}  3{com}.         quietly replace FE in `i' = FE[`i'-1]+1 if Team[`i'] != Team[`i'-1]
{txt}  4{com}. {c )-}
{txt}
{com}. drop ActualTeam Diff Playoffs SBApp SBWin
{txt}
{com}. xtset FE Season
{res}
{col 1}{txt:Panel variable: }{res:FE}{txt: (strongly balanced)}
{p 1 16 2}{txt:Time variable: }{res:Season}{txt:, }{res:{bind:2011}}{txt: to }{res:{bind:2024}}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}
{com}. 
. forvalues i = 1/32 {c -(}
{txt}  2{com}.         quietly gen FE`i' = 0
{txt}  3{com}.         quietly replace FE`i' = 1 if FE == `i'
{txt}  4{com}. {c )-}
{txt}
{com}. forvalues i = 2011/2024 {c -(}
{txt}  2{com}.         quietly gen Season`i' = 0
{txt}  3{com}.         quietly replace Season`i' = 1 if Season == `i'
{txt}  4{com}. {c )-}
{txt}
{com}. 
. * Replace season fixed effects with 17 game season dummy
. gen SeasonPost2021 = 0
{txt}
{com}. replace SeasonPost2021 = 1 if Season >= 2021
{txt}(128 real changes made)

{com}. replace SeasonPost2021 = 0 if Season == 2022 & (Team == "Buffalo Bills" | Team == "Cincinnati Bengals")
{txt}(2 real changes made)

{com}. 
. * Generate variables (Pool FB with RB)
. gen RBFBAV = RBAV+FBAV
{txt}
{com}. gen RBFBCap = RBCap+FBCap
{txt}
{com}. gen Cap = QBCap+RBFBCap+WRCap+TECap+LTCap+GCap+CCap+RTCap+DECap+DTCap+ILBCap+OLBCap+CBCap+FSCap+SSCap+KCap+PCap+LSCap
{txt}
{com}. foreach i in Rook Vet {c -(}
{txt}  2{com}.         gen `i'RBFBAV = `i'RBAV+`i'FBAV
{txt}  3{com}.         gen `i'RBFBCap = `i'RBCap+`i'FBCap
{txt}  4{com}.         gen `i'Cap = `i'QBCap+`i'RBFBCap+`i'WRCap+`i'TECap+`i'LTCap+`i'GCap+`i'CCap+`i'RTCap+`i'DECap+`i'DTCap+`i'ILBCap+`i'OLBCap+`i'CBCap+`i'FSCap+`i'SSCap+`i'KCap+`i'PCap+`i'LSCap
{txt}  5{com}.         
.         foreach x in QB RBFB WR TE LT G C RT DE DT ILB OLB CB FS SS K P LS {c -(}
{txt}  6{com}.                 quietly gen `i'`x'CapPct = `i'`x'Cap/`i'Cap*100
{txt}  7{com}.                 if `CapFlag' == 0 {c -(}
{txt}  8{com}.                         quietly gen `i'`x'ZeroDum = 0
{txt}  9{com}.                         quietly replace `i'`x'ZeroDum = 1 if `i'`x'CapPct == 0
{txt} 10{com}.                         quietly gen `i'`x'CapPctZTO = `i'`x'CapPct
{txt} 11{com}.                         quietly replace `i'`x'CapPctZTO = 1 if `i'`x'CapPctZTO == 0
{txt} 12{com}.                         quietly gen Log`i'`x'CapPctZTO = log(`i'`x'CapPctZTO)
{txt} 13{com}.                 {c )-}
{txt} 14{com}.                 else if `CapFlag' == 2 {c -(}
{txt} 15{com}.                         quietly gen Sqrt`i'`x'CapPct = sqrt(`i'`x'CapPct)
{txt} 16{com}.                 {c )-}
{txt} 17{com}.         {c )-}
{txt} 18{com}. {c )-}
{txt}
{com}. 
. * First half
. matrix ImpCoefs1 = J(`Reps', `End', .)
{txt}
{com}. matrix CECoefs1 = J(`Reps', 36, .)
{txt}
{com}. 
. forvalues i = 1/`Reps' {c -(}
{txt}  2{com}.     preserve
{txt}  3{com}.     bsample, cluster(FE)
{txt}  4{com}.         
.         * Importance regression
.         capture {c -(}
{txt}  5{com}.                 if `CoYFlag' == 0 {c -(}
{txt}  6{com}.                         reg Wins QBAV RBFBAV WRAV TEAV LTAV GAV CAV RTAV DEAV DTAV ILBAV OLBAV CBAV FSAV SSAV KAV PAV LSAV WinTotal MissWinTotal SeasonPost2021 i.FE, vce(cluster FE)
{txt}  7{com}.                 {c )-}
{txt}  8{com}.                 else if `CoYFlag' == 1 {c -(}
{txt}  9{com}.                         reg Wins QBAV RBFBAV WRAV TEAV LTAV GAV CAV RTAV DEAV DTAV ILBAV OLBAV CBAV FSAV SSAV KAV PAV LSAV WinTotal MissWinTotal SeasonPost2021 CoY i.FE, vce(cluster FE)
{txt} 10{com}.                 {c )-}
{txt} 11{com}.         {c )-}
{txt} 12{com}. 
.         if _rc == 0 {c -(}
{txt} 13{com}.                 matrix Uncon = e(b)
{txt} 14{com}.                 forvalues j = 1/`End' {c -(}
{txt} 15{com}.                         matrix ImpCoefs1[`i',`j'] = Uncon[1,`j']
{txt} 16{com}.                 {c )-}
{txt} 17{com}.         {c )-}
{txt} 18{com}.         
.         else {c -(}
{txt} 19{com}.                 display as error "Warning: OLS failed on rep `i'"
{txt} 20{com}.         {c )-}
{txt} 21{com}.         
.         * Cost effectiveness regressions
.         local j = 1
{txt} 22{com}.         foreach c in Rook Vet {c -(}
{txt} 23{com}.                 foreach x in QB RBFB WR TE LT G C RT DE DT ILB OLB CB FS SS K P LS {c -(}
{txt} 24{com}.                         capture {c -(}
{txt} 25{com}.                                 if `CapFlag' == 0 {c -(}
{txt} 26{com}.                                         reg `c'`x'AV Log`c'`x'CapPctZTO `c'`x'ZeroDum, vce(cluster FE)
{txt} 27{com}.                                 {c )-}
{txt} 28{com}.                                 else if `CapFlag' == 2 {c -(}
{txt} 29{com}.                                         reg `c'`x'AV Sqrt`c'`x'CapPct, vce(cluster FE)
{txt} 30{com}.                                 {c )-}
{txt} 31{com}.                         {c )-}
{txt} 32{com}.                         
.                         if _rc == 0 {c -(}
{txt} 33{com}.                                 matrix Coefs`j' = e(b)
{txt} 34{com}.                                 matrix CECoefs1[`i',`j'] = Coefs`j'[1,1]
{txt} 35{com}.                         {c )-}
{txt} 36{com}.                         
.                         else {c -(}
{txt} 37{com}.                                 display as error "Warning: OLS failed on rep `i' reg `j'"
{txt} 38{com}.                         {c )-}
{txt} 39{com}.                         
.                         local ++j
{txt} 40{com}.                 {c )-}
{txt} 41{com}.         {c )-}
{txt} 42{com}.         
.     restore
{txt} 43{com}.     if mod(`i', `Progress') == 0 display as text "First matrix: Completed rep `i' of `Reps'"
{txt} 44{com}. {c )-}
{txt}First matrix: Completed rep 50 of 500
First matrix: Completed rep 100 of 500
First matrix: Completed rep 150 of 500
First matrix: Completed rep 200 of 500
First matrix: Completed rep 250 of 500
First matrix: Completed rep 300 of 500
First matrix: Completed rep 350 of 500
First matrix: Completed rep 400 of 500
First matrix: Completed rep 450 of 500
First matrix: Completed rep 500 of 500

{com}. 
. if `CoYFlag' == 0 {c -(}
.         matrix colnames ImpCoefs1 = QBAVCoef RBFBAVCoef WRAVCoef TEAVCoef LTAVCoef GAVCoef CAVCoef RTAVCoef DEAVCoef DTAVCoef ILBAVCoef OLBAVCoef CBAVCoef FSAVCoef SSAVCoef KAVCoef PAVCoef LSAVCoef WinTotalCoef MissWinTotalCoef SeasonPost2021Coef
. {c )-}
{txt}
{com}. else if `CoYFlag' == 1 {c -(}
.         matrix colnames ImpCoefs1 = QBAVCoef RBFBAVCoef WRAVCoef TEAVCoef LTAVCoef GAVCoef CAVCoef RTAVCoef DEAVCoef DTAVCoef ILBAVCoef OLBAVCoef CBAVCoef FSAVCoef SSAVCoef KAVCoef PAVCoef LSAVCoef WinTotalCoef MissWinTotalCoef SeasonPost2021Coef CoYCoef
. {c )-}
{txt}
{com}. matrix PosImpCoefs1 = ImpCoefs1[1..rowsof(ImpCoefs1), 1..18]
{txt}
{com}. matrix colnames PosImpCoefs1 = QBAVCoef RBFBAVCoef WRAVCoef TEAVCoef LTAVCoef GAVCoef CAVCoef RTAVCoef DEAVCoef DTAVCoef ILBAVCoef OLBAVCoef CBAVCoef FSAVCoef SSAVCoef KAVCoef PAVCoef LSAVCoef
{txt}
{com}. 
. matrix colnames CECoefs1 = RookQB RookRBFB RookWR RookTE RookLT RookG RookC RookRT RookDE RookDT RookILB RookOLB RookCB RookFS RookSS RookK RookP RookLS VetQB VetRBFB VetWR VetTE VetLT VetG VetC VetRT VetDE VetDT VetILB VetOLB VetCB VetFS VetSS VetK VetP VetLS
{txt}
{com}. matrix RookCECoefs1 = CECoefs1[1..rowsof(CECoefs1), 1..18]
{txt}
{com}. matrix VetCECoefs1 = CECoefs1[1..rowsof(CECoefs1), 19..36]
{txt}
{com}. matrix colnames RookCECoefs1 = RookQB RookRBFB RookWR RookTE RookLT RookG RookC RookRT RookDE RookDT RookILB RookOLB RookCB RookFS RookSS RookK RookP RookLS
{txt}
{com}. matrix colnames VetCECoefs1 = VetQB VetRBFB VetWR VetTE VetLT VetG VetC VetRT VetDE VetDT VetILB VetOLB VetCB VetFS VetSS VetK VetP VetLS
{txt}
{com}. 
. * Calculate optimal allocations
. if `CapFlag' == 0 {c -(}
.         foreach c in Rook Vet {c -(}
{txt}  2{com}.                 matrix `c'Denom1 = J(`Reps', 1, .)
{txt}  3{com}.                 foreach x in QB RBFB WR TE LT G C RT DE DT ILB OLB CB FS SS K P LS {c -(}
{txt}  4{com}.                         matrix `c'`x'1 = J(`Reps', 1, .)
{txt}  5{com}.                 {c )-}
{txt}  6{com}. 
.                 forvalues i = 1/`Reps' {c -(}
{txt}  7{com}.                         matrix `c'Denom1[`i',1] = PosImpCoefs1[`i',1..colsof(PosImpCoefs1)]*`c'CECoefs1[`i',1..colsof(`c'CECoefs1)]'
{txt}  8{com}.                         
.                         local j = 1
{txt}  9{com}.                         foreach x in QB RBFB WR TE LT G C RT DE DT ILB OLB CB FS SS K P LS {c -(}
{txt} 10{com}.                                 matrix `c'`x'1[`i',1] = PosImpCoefs1[`i',`j']*`c'CECoefs1[`i',`j']/`c'Denom1[`i',1]
{txt} 11{com}.                                 local ++j
{txt} 12{com}.                         {c )-}
{txt} 13{com}.                 {c )-}
{txt} 14{com}.         {c )-}
. {c )-}
{txt}
{com}. 
. else if `CapFlag' == 2 {c -(}
.         * Sqrt spec -> square the products
.         foreach c in Rook Vet {c -(}
{txt}  2{com}.                 matrix `c'Denom1 = J(`Reps', 1, .)
{txt}  3{com}.                 foreach x in QB RBFB WR TE LT G C RT DE DT ILB OLB CB FS SS K P LS {c -(}
{txt}  4{com}.                         matrix `c'`x'1 = J(`Reps', 1, .)
{txt}  5{com}.                 {c )-}
{txt}  6{com}. 
.                 forvalues i = 1/`Reps' {c -(}
{txt}  7{com}.                         scalar __den = 0
{txt}  8{com}.                         local j = 1
{txt}  9{com}. 
.                         * Pass 1: store squared numerators and accumulate denominator
.                         foreach x in QB RBFB WR TE LT G C RT DE DT ILB OLB CB FS SS K P LS {c -(}
{txt} 10{com}.                                 scalar __num = PosImpCoefs1[`i',`j'] * `c'CECoefs1[`i',`j']
{txt} 11{com}.                                 scalar __num2 = __num^2
{txt} 12{com}.                                 matrix `c'`x'1[`i',1] = __num2
{txt} 13{com}.                                 scalar __den = __den + __num2
{txt} 14{com}.                                 local ++j
{txt} 15{com}.                         {c )-}
{txt} 16{com}. 
.                         * Guard against degenerate case (all zeros)
.                         if (__den<=0) {c -(}
{txt} 17{com}.                                 * split mass evenly to avoid missing values; tweak if you prefer zeros
.                                 foreach x in QB RBFB WR TE LT G C RT DE DT ILB OLB CB FS SS K P LS {c -(}
{txt} 18{com}.                                         matrix `c'`x'1[`i',1] = 1/18
{txt} 19{com}.                                 {c )-}
{txt} 20{com}.                                 matrix `c'Denom1[`i',1] = 0
{txt} 21{com}.                         {c )-}
{txt} 22{com}.                         else {c -(}
{txt} 23{com}.                                 * Pass 2: normalize
.                                 foreach x in QB RBFB WR TE LT G C RT DE DT ILB OLB CB FS SS K P LS {c -(}
{txt} 24{com}.                                         matrix `c'`x'1[`i',1] = `c'`x'1[`i',1] / __den
{txt} 25{com}.                                 {c )-}
{txt} 26{com}.                                 matrix `c'Denom1[`i',1] = __den
{txt} 27{com}.                         {c )-}
{txt} 28{com}.                 {c )-}
{txt} 29{com}.         {c )-}
. {c )-}
{txt}
{com}. 
. matrix Opt1 = [RookQB1, RookRBFB1, RookWR1, RookTE1, RookLT1, RookG1, RookC1, RookRT1, RookDE1, RookDT1, RookILB1, RookOLB1, RookCB1, RookFS1, RookSS1, RookK1, RookP1, RookLS1, ///
> VetQB1, VetRBFB1, VetWR1, VetTE1, VetLT1, VetG1, VetC1, VetRT1, VetDE1, VetDT1, VetILB1, VetOLB1, VetCB1, VetFS1, VetSS1, VetK1, VetP1, VetLS1]
{txt}
{com}. matrix colnames Opt1 = RookQB RookRBFB RookWR RookTE RookLT RookG RookC RookRT RookDE RookDT RookILB RookOLB RookCB RookFS RookSS RookK RookP RookLS ///
> VetQB VetRBFB VetWR VetTE VetLT VetG VetC VetRT VetDE VetDT VetILB VetOLB VetCB VetFS VetSS VetK VetP VetLS
{txt}
{com}. 
. matrix ImpCoefsOpt1 = [ImpCoefs1, Opt1]
{txt}
{com}. if `CoYFlag' == 0 {c -(}
.         matrix colnames ImpCoefsOpt1 = QBAVCoef RBFBAVCoef WRAVCoef TEAVCoef LTAVCoef GAVCoef CAVCoef RTAVCoef DEAVCoef DTAVCoef ILBAVCoef OLBAVCoef CBAVCoef FSAVCoef SSAVCoef KAVCoef PAVCoef LSAVCoef WinTotalCoef MissWinTotalCoef SeasonPost2021Coef ///
> RookQB RookRBFB RookWR RookTE RookLT RookG RookC RookRT RookDE RookDT RookILB RookOLB RookCB RookFS RookSS RookK RookP RookLS ///
> VetQB VetRBFB VetWR VetTE VetLT VetG VetC VetRT VetDE VetDT VetILB VetOLB VetCB VetFS VetSS VetK VetP VetLS
. {c )-}
{txt}
{com}. else if `CoYFlag' == 1 {c -(}
.         matrix colnames ImpCoefsOpt1 = QBAVCoef RBFBAVCoef WRAVCoef TEAVCoef LTAVCoef GAVCoef CAVCoef RTAVCoef DEAVCoef DTAVCoef ILBAVCoef OLBAVCoef CBAVCoef FSAVCoef SSAVCoef KAVCoef PAVCoef LSAVCoef WinTotalCoef MissWinTotalCoef SeasonPost2021Coef CoYCoef ///
> RookQB RookRBFB RookWR RookTE RookLT RookG RookC RookRT RookDE RookDT RookILB RookOLB RookCB RookFS RookSS RookK RookP RookLS ///
> VetQB VetRBFB VetWR VetTE VetLT VetG VetC VetRT VetDE VetDT VetILB VetOLB VetCB VetFS VetSS VetK VetP VetLS
. {c )-}
{txt}
{com}. 
. * Second half
. matrix ImpCoefs2 = J(`Reps', `End', .)
{txt}
{com}. matrix CECoefs2 = J(`Reps', 36, .)
{txt}
{com}. 
. forvalues i = 1/`Reps' {c -(}
{txt}  2{com}.     preserve
{txt}  3{com}.     bsample, cluster(FE)
{txt}  4{com}.         
.         * Importance regression
.         capture {c -(}
{txt}  5{com}.                 if `CoYFlag' == 0 {c -(}
{txt}  6{com}.                         reg Wins QBAV RBFBAV WRAV TEAV LTAV GAV CAV RTAV DEAV DTAV ILBAV OLBAV CBAV FSAV SSAV KAV PAV LSAV WinTotal MissWinTotal SeasonPost2021 i.FE, vce(cluster FE)
{txt}  7{com}.                 {c )-}
{txt}  8{com}.                 else if `CoYFlag' == 1 {c -(}
{txt}  9{com}.                         reg Wins QBAV RBFBAV WRAV TEAV LTAV GAV CAV RTAV DEAV DTAV ILBAV OLBAV CBAV FSAV SSAV KAV PAV LSAV WinTotal MissWinTotal SeasonPost2021 CoY i.FE, vce(cluster FE)
{txt} 10{com}.                 {c )-}
{txt} 11{com}.         {c )-}
{txt} 12{com}. 
.         if _rc == 0 {c -(}
{txt} 13{com}.                 matrix Uncon = e(b)
{txt} 14{com}.                 forvalues j = 1/`End' {c -(}
{txt} 15{com}.                         matrix ImpCoefs2[`i',`j'] = Uncon[1,`j']
{txt} 16{com}.                 {c )-}
{txt} 17{com}.         {c )-}
{txt} 18{com}.         
.         else {c -(}
{txt} 19{com}.                 display as error "Warning: OLS failed on rep `i'"
{txt} 20{com}.         {c )-}
{txt} 21{com}.         
.         * Cost effectiveness regressions
.         local j = 1
{txt} 22{com}.         foreach c in Rook Vet {c -(}
{txt} 23{com}.                 foreach x in QB RBFB WR TE LT G C RT DE DT ILB OLB CB FS SS K P LS {c -(}
{txt} 24{com}.                         capture {c -(}
{txt} 25{com}.                                 if `CapFlag' == 0 {c -(}
{txt} 26{com}.                                         reg `c'`x'AV Log`c'`x'CapPctZTO `c'`x'ZeroDum, vce(cluster FE)
{txt} 27{com}.                                 {c )-}
{txt} 28{com}.                                 else if `CapFlag' == 2 {c -(}
{txt} 29{com}.                                         reg `c'`x'AV Sqrt`c'`x'CapPct, vce(cluster FE)
{txt} 30{com}.                                 {c )-}
{txt} 31{com}.                         {c )-}
{txt} 32{com}.                         
.                         if _rc == 0 {c -(}
{txt} 33{com}.                                 matrix Coefs`j' = e(b)
{txt} 34{com}.                                 matrix CECoefs2[`i',`j'] = Coefs`j'[1,1]
{txt} 35{com}.                         {c )-}
{txt} 36{com}.                         
.                         else {c -(}
{txt} 37{com}.                                 display as error "Warning: OLS failed on rep `i' reg `j'"
{txt} 38{com}.                         {c )-}
{txt} 39{com}.                         
.                         local ++j
{txt} 40{com}.                 {c )-}
{txt} 41{com}.         {c )-}
{txt} 42{com}.         
.     restore
{txt} 43{com}.     if mod(`i', `Progress') == 0 display as text "Second matrix: Completed rep `i' of `Reps'"
{txt} 44{com}. {c )-}
{txt}Second matrix: Completed rep 50 of 500
Second matrix: Completed rep 100 of 500
Second matrix: Completed rep 150 of 500
Second matrix: Completed rep 200 of 500
Second matrix: Completed rep 250 of 500
Second matrix: Completed rep 300 of 500
Second matrix: Completed rep 350 of 500
Second matrix: Completed rep 400 of 500
Second matrix: Completed rep 450 of 500
Second matrix: Completed rep 500 of 500

{com}. 
. if `CoYFlag' == 0 {c -(}
.         matrix colnames ImpCoefs2 = QBAVCoef RBFBAVCoef WRAVCoef TEAVCoef LTAVCoef GAVCoef CAVCoef RTAVCoef DEAVCoef DTAVCoef ILBAVCoef OLBAVCoef CBAVCoef FSAVCoef SSAVCoef KAVCoef PAVCoef LSAVCoef WinTotalCoef MissWinTotalCoef SeasonPost2021Coef
. {c )-}
{txt}
{com}. else if `CoYFlag' == 1 {c -(}
.         matrix colnames ImpCoefs2 = QBAVCoef RBFBAVCoef WRAVCoef TEAVCoef LTAVCoef GAVCoef CAVCoef RTAVCoef DEAVCoef DTAVCoef ILBAVCoef OLBAVCoef CBAVCoef FSAVCoef SSAVCoef KAVCoef PAVCoef LSAVCoef WinTotalCoef MissWinTotalCoef SeasonPost2021Coef CoYCoef
. {c )-}
{txt}
{com}. matrix PosImpCoefs2 = ImpCoefs2[1..rowsof(ImpCoefs1), 1..18]
{txt}
{com}. matrix colnames PosImpCoefs2 = QBAVCoef RBFBAVCoef WRAVCoef TEAVCoef LTAVCoef GAVCoef CAVCoef RTAVCoef DEAVCoef DTAVCoef ILBAVCoef OLBAVCoef CBAVCoef FSAVCoef SSAVCoef KAVCoef PAVCoef LSAVCoef
{txt}
{com}. 
. matrix colnames CECoefs2 = RookQB RookRBFB RookWR RookTE RookLT RookG RookC RookRT RookDE RookDT RookILB RookOLB RookCB RookFS RookSS RookK RookP RookLS VetQB VetRBFB VetWR VetTE VetLT VetG VetC VetRT VetDE VetDT VetILB VetOLB VetCB VetFS VetSS VetK VetP VetLS
{txt}
{com}. matrix RookCECoefs2 = CECoefs2[1..rowsof(CECoefs1), 1..18]
{txt}
{com}. matrix VetCECoefs2 = CECoefs2[1..rowsof(CECoefs1), 19..36]
{txt}
{com}. matrix colnames RookCECoefs2 = RookQB RookRBFB RookWR RookTE RookLT RookG RookC RookRT RookDE RookDT RookILB RookOLB RookCB RookFS RookSS RookK RookP RookLS
{txt}
{com}. matrix colnames VetCECoefs2 = VetQB VetRBFB VetWR VetTE VetLT VetG VetC VetRT VetDE VetDT VetILB VetOLB VetCB VetFS VetSS VetK VetP VetLS
{txt}
{com}. 
. * Calculate optimal allocations
. if `CapFlag' == 0 {c -(}
.         foreach c in Rook Vet {c -(}
{txt}  2{com}.                 matrix `c'Denom2 = J(`Reps', 1, .)
{txt}  3{com}.                 foreach x in QB RBFB WR TE LT G C RT DE DT ILB OLB CB FS SS K P LS {c -(}
{txt}  4{com}.                         matrix `c'`x'2 = J(`Reps', 1, .)
{txt}  5{com}.                 {c )-}
{txt}  6{com}. 
.                 forvalues i = 1/`Reps' {c -(}
{txt}  7{com}.                         matrix `c'Denom2[`i',1] = PosImpCoefs2[`i',1..colsof(PosImpCoefs2)]*`c'CECoefs2[`i',1..colsof(`c'CECoefs2)]'
{txt}  8{com}.                         
.                         local j = 1
{txt}  9{com}.                         foreach x in QB RBFB WR TE LT G C RT DE DT ILB OLB CB FS SS K P LS {c -(}
{txt} 10{com}.                                 matrix `c'`x'2[`i',1] = PosImpCoefs2[`i',`j']*`c'CECoefs2[`i',`j']/`c'Denom2[`i',1]
{txt} 11{com}.                                 local ++j
{txt} 12{com}.                         {c )-}
{txt} 13{com}.                 {c )-}
{txt} 14{com}.         {c )-}
. {c )-}
{txt}
{com}. 
. else if `CapFlag' == 2 {c -(}
.         * Sqrt spec -> square the products
.         foreach c in Rook Vet {c -(}
{txt}  2{com}.                 matrix `c'Denom2 = J(`Reps', 1, .)
{txt}  3{com}.                 foreach x in QB RBFB WR TE LT G C RT DE DT ILB OLB CB FS SS K P LS {c -(}
{txt}  4{com}.                         matrix `c'`x'2 = J(`Reps', 1, .)
{txt}  5{com}.                 {c )-}
{txt}  6{com}. 
.                 forvalues i = 1/`Reps' {c -(}
{txt}  7{com}.                         scalar __den = 0
{txt}  8{com}.                         local j = 1
{txt}  9{com}. 
.                         * Pass 1: store squared numerators and accumulate denominator
.                         foreach x in QB RBFB WR TE LT G C RT DE DT ILB OLB CB FS SS K P LS {c -(}
{txt} 10{com}.                                 scalar __num  = PosImpCoefs2[`i',`j'] * `c'CECoefs2[`i',`j']
{txt} 11{com}.                                 scalar __num2 = __num^2
{txt} 12{com}.                                 matrix `c'`x'2[`i',1] = __num2
{txt} 13{com}.                                 scalar __den = __den + __num2
{txt} 14{com}.                                 local ++j
{txt} 15{com}.                         {c )-}
{txt} 16{com}. 
.                         * Guard against degenerate case (all zeros)
.                         if (__den<=0) {c -(}
{txt} 17{com}.                                 foreach x in QB RBFB WR TE LT G C RT DE DT ILB OLB CB FS SS K P LS {c -(}
{txt} 18{com}.                                         matrix `c'`x'2[`i',1] = 1/18
{txt} 19{com}.                                 {c )-}
{txt} 20{com}.                                 matrix `c'Denom2[`i',1] = 0
{txt} 21{com}.                         {c )-}
{txt} 22{com}.                         else {c -(}
{txt} 23{com}.                                 * Pass 2: normalize
.                                 foreach x in QB RBFB WR TE LT G C RT DE DT ILB OLB CB FS SS K P LS {c -(}
{txt} 24{com}.                                         matrix `c'`x'2[`i',1] = `c'`x'2[`i',1] / __den
{txt} 25{com}.                                 {c )-}
{txt} 26{com}.                                 matrix `c'Denom2[`i',1] = __den
{txt} 27{com}.                         {c )-}
{txt} 28{com}.                 {c )-}
{txt} 29{com}.         {c )-}
. {c )-}
{txt}
{com}. 
. matrix Opt2 = [RookQB2, RookRBFB2, RookWR2, RookTE2, RookLT2, RookG2, RookC2, RookRT2, RookDE2, RookDT2, RookILB2, RookOLB2, RookCB2, RookFS2, RookSS2, RookK2, RookP2, RookLS2, ///
> VetQB2, VetRBFB2, VetWR2, VetTE2, VetLT2, VetG2, VetC2, VetRT2, VetDE2, VetDT2, VetILB2, VetOLB2, VetCB2, VetFS2, VetSS2, VetK2, VetP2, VetLS2]
{txt}
{com}. matrix colnames Opt2 = RookQB RookRBFB RookWR RookTE RookLT RookG RookC RookRT RookDE RookDT RookILB RookOLB RookCB RookFS RookSS RookK RookP RookLS ///
> VetQB VetRBFB VetWR VetTE VetLT VetG VetC VetRT VetDE VetDT VetILB VetOLB VetCB VetFS VetSS VetK VetP VetLS
{txt}
{com}. 
. matrix ImpCoefsOpt2 = [ImpCoefs2, Opt2]
{txt}
{com}. if `CoYFlag' == 0 {c -(}
.         matrix colnames ImpCoefsOpt2 = QBAVCoef RBFBAVCoef WRAVCoef TEAVCoef LTAVCoef GAVCoef CAVCoef RTAVCoef DEAVCoef DTAVCoef ILBAVCoef OLBAVCoef CBAVCoef FSAVCoef SSAVCoef KAVCoef PAVCoef LSAVCoef WinTotalCoef MissWinTotalCoef SeasonPost2021Coef ///
> RookQB RookRBFB RookWR RookTE RookLT RookG RookC RookRT RookDE RookDT RookILB RookOLB RookCB RookFS RookSS RookK RookP RookLS ///
> VetQB VetRBFB VetWR VetTE VetLT VetG VetC VetRT VetDE VetDT VetILB VetOLB VetCB VetFS VetSS VetK VetP VetLS
. {c )-}
{txt}
{com}. else if `CoYFlag' == 1 {c -(}
.         matrix colnames ImpCoefsOpt2 = QBAVCoef RBFBAVCoef WRAVCoef TEAVCoef LTAVCoef GAVCoef CAVCoef RTAVCoef DEAVCoef DTAVCoef ILBAVCoef OLBAVCoef CBAVCoef FSAVCoef SSAVCoef KAVCoef PAVCoef LSAVCoef WinTotalCoef MissWinTotalCoef SeasonPost2021Coef CoYCoef ///
> RookQB RookRBFB RookWR RookTE RookLT RookG RookC RookRT RookDE RookDT RookILB RookOLB RookCB RookFS RookSS RookK RookP RookLS ///
> VetQB VetRBFB VetWR VetTE VetLT VetG VetC VetRT VetDE VetDT VetILB VetOLB VetCB VetFS VetSS VetK VetP VetLS
. {c )-}
{txt}
{com}. 
. * Convert and save ImpCoefsOpt1
. drop _all
{txt}
{com}. svmat ImpCoefsOpt1, names(col)
{txt}number of observations will be reset to 500
Press any key to continue, or Break to abort
{p}
Number of observations ({bf:_N}) was 0,
now 500.
{p_end}

{com}. gen rep = _n
{txt}
{com}. tempfile boot1
{txt}
{com}. save `boot1', replace
{txt}{p 0 4 2}
(file {bf}
C:\Users\Owner\AppData\Local\Temp\ST_4474_0000tf.tmp{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
C:\Users\Owner\AppData\Local\Temp\ST_4474_0000tf.tmp{rm}
saved
as .dta format
{p_end}

{com}. 
. * Clear memory to prepare for second matrix
. clear
{txt}
{com}. 
. * Convert and save ImpCoefsOpt2
. svmat ImpCoefsOpt2, names(col)
{txt}number of observations will be reset to 500
Press any key to continue, or Break to abort
{p}
Number of observations ({bf:_N}) was 0,
now 500.
{p_end}

{com}. gen rep = _n + `Reps'
{txt}
{com}. tempfile boot2
{txt}
{com}. save `boot2', replace
{txt}{p 0 4 2}
(file {bf}
C:\Users\Owner\AppData\Local\Temp\ST_4474_0000tg.tmp{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
C:\Users\Owner\AppData\Local\Temp\ST_4474_0000tg.tmp{rm}
saved
as .dta format
{p_end}

{com}. 
. * Append and save final combined dataset
. use `boot1', clear
{txt}
{com}. append using `boot2'
{txt}
{com}. replace MissWinTotalCoef = . if MissWinTotalCoef == 0
{txt}(342 real changes made, 342 to missing)

{com}. replace SeasonPost2021Coef = . if SeasonPost2021Coef == 0
{txt}(0 real changes made)

{com}. drop rep
{txt}
{com}. 
. * OLS standard errors
. if `CoYFlag' == 0 {c -(}
.         local i = 1
.         foreach x in QBAVCoef RBFBAVCoef WRAVCoef TEAVCoef LTAVCoef GAVCoef CAVCoef RTAVCoef DEAVCoef DTAVCoef ILBAVCoef OLBAVCoef CBAVCoef FSAVCoef SSAVCoef KAVCoef PAVCoef LSAVCoef WinTotalCoef MissWinTotalCoef SeasonPost2021Coef {c -(}
{txt}  2{com}.                 quietly sum `x'
{txt}  3{com}.                 scalar SE`i' = r(sd)
{txt}  4{com}.                 local ++i
{txt}  5{com}.         {c )-}
.         
.         matrix SE = [SE1\SE2\SE3\SE4\SE5\SE6\SE7\SE8\SE9\SE10\SE11\SE12\SE13\SE14\SE15\SE16\SE17\SE18\SE19\SE20\SE21]
.         matrix rownames SE = QBAVSE RBFBAVSE WRAVSE TEAVSE LTAVSE GAVSE CAVSE RTAVSE DEAVSE DTAVSE ILBAVSE OLBAVSE CBAVSE FSAVSE SSAVSE KAVSE PAVSE LSAVSE WinTotalSE MissWinTotalSE SeasonPost2021SE
.         matrix list SE
{res}
{txt}SE[21,1]
                     c1
      QBAVSE {res} .03952457
{txt}    RBFBAVSE {res} .02617693
{txt}      WRAVSE {res} .02648467
{txt}      TEAVSE {res} .03146696
{txt}      LTAVSE {res} .02104989
{txt}       GAVSE {res} .02028649
{txt}       CAVSE {res}  .0353985
{txt}      RTAVSE {res} .02690168
{txt}      DEAVSE {res}  .0135198
{txt}      DTAVSE {res} .01427146
{txt}     ILBAVSE {res} .01698638
{txt}     OLBAVSE {res} .01394671
{txt}      CBAVSE {res} .01899944
{txt}      FSAVSE {res} .02579447
{txt}      SSAVSE {res} .02302405
{txt}       KAVSE {res} .04552669
{txt}       PAVSE {res} .07508313
{txt}      LSAVSE {res} .09001487
{txt}  WinTotalSE {res} .04212601
{txt}MissWinTot~E {res} .31361621
{txt}SeasonPost~E {res} .15937616
{reset}{com}. {c )-}
{txt}
{com}. 
. else if `CoYFlag' == 1 {c -(}
.         local i = 1
.         foreach x in QBAVCoef RBFBAVCoef WRAVCoef TEAVCoef LTAVCoef GAVCoef CAVCoef RTAVCoef DEAVCoef DTAVCoef ILBAVCoef OLBAVCoef CBAVCoef FSAVCoef SSAVCoef KAVCoef PAVCoef LSAVCoef WinTotalCoef MissWinTotalCoef SeasonPost2021Coef CoYCoef {c -(}
{txt}  2{com}.                 quietly sum `x'
{txt}  3{com}.                 scalar SE`i' = r(sd)
{txt}  4{com}.                 local ++i
{txt}  5{com}.         {c )-}
.         
.         matrix SE = [SE1\SE2\SE3\SE4\SE5\SE6\SE7\SE8\SE9\SE10\SE11\SE12\SE13\SE14\SE15\SE16\SE17\SE18\SE19\SE20\SE21\SE22]
.         matrix rownames SE = QBAVSE RBFBAVSE WRAVSE TEAVSE LTAVSE GAVSE CAVSE RTAVSE DEAVSE DTAVSE ILBAVSE OLBAVSE CBAVSE FSAVSE SSAVSE KAVSE PAVSE LSAVSE WinTotalSE MissWinTotalSE SeasonPost2021SE CoYSE
.         matrix list SE
. {c )-}
{txt}
{com}. 
. * Confidence intervals
. matrix RookLB = J(18,1,.)
{txt}
{com}. matrix RookUB = J(18,1,.)
{txt}
{com}. local i = 1
{txt}
{com}. foreach x in RookQB RookRBFB RookWR RookTE RookLT RookG RookC RookRT RookDE RookDT RookILB RookOLB RookCB RookFS RookSS RookK RookP RookLS {c -(}
{txt}  2{com}.         _pctile `x', p(2.5 97.5)
{txt}  3{com}.         matrix RookLB[`i',1] = r(r1)
{txt}  4{com}.         matrix RookUB[`i',1] = r(r2)
{txt}  5{com}.         local ++i
{txt}  6{com}. {c )-}
{txt}
{com}. 
. matrix VetLB = J(18,1,.)
{txt}
{com}. matrix VetUB = J(18,1,.)
{txt}
{com}. local i = 1
{txt}
{com}. foreach x in VetQB VetRBFB VetWR VetTE VetLT VetG VetC VetRT VetDE VetDT VetILB VetOLB VetCB VetFS VetSS VetK VetP VetLS {c -(}
{txt}  2{com}.         _pctile `x', p(2.5 97.5)
{txt}  3{com}.         matrix VetLB[`i',1] = r(r1)
{txt}  4{com}.         matrix VetUB[`i',1] = r(r2)
{txt}  5{com}.         local ++i
{txt}  6{com}. {c )-}
{txt}
{com}. 
. matrix CI = [RookLB, RookUB, VetLB, VetUB]
{txt}
{com}. matrix colnames CI = RookLB RookUB VetLB VetUB
{txt}
{com}. matrix rownames CI = QB RBFB WR TE LT G C RT DE DT ILB OLB CB FS SS K P LS
{txt}
{com}. matrix list CI
{res}
{txt}CI[18,4]
         RookLB     RookUB      VetLB      VetUB
  QB {res} .00243326  .15528647    .002969  .16837651
{txt}RBFB {res} .02939613  .24531726  .03478612  .21142792
{txt}  WR {res} .06143602  .30854423  .05226943  .26773357
{txt}  TE {res} .00033358    .050716   .0004131  .05692042
{txt}  LT {res} .00318335  .05097472  .00298968  .04928422
{txt}   G {res} .00896772   .1022086  .01262932  .12751243
{txt}   C {res} .00163074  .11261961  .00159202  .11027721
{txt}  RT {res} .00523929  .11045193  .00637343  .10081708
{txt}  DE {res}  .0193338  .10356743  .02340523  .10134904
{txt}  DT {res} .02680034  .13615758  .02294411  .11224626
{txt} ILB {res} .02078672  .13430446  .02835159  .13688118
{txt} OLB {res} .04822315  .14057822  .04195341  .12899911
{txt}  CB {res} .02195695  .14052472  .02959033  .13884129
{txt}  FS {res} .03076175  .15831257  .03425987  .17465539
{txt}  SS {res} .00503138  .06209344  .00517396  .07188674
{txt}   K {res} 5.955e-06   .0261961  3.179e-06  .01446448
{txt}   P {res} .00003355  .07341503  .00002325  .05598603
{txt}  LS {res} 3.096e-06  .01893995  9.594e-06  .04813437
{reset}
{com}. 
. 
. if `SeasonFlag' == 0 & `CapFlag' == 0 {c -(}
.         save "C:/Users/Owner/OneDrive/Documents/Georgetown University/Thesis Writer/Research/QB Worth/Season Analysis/Data 25 Season Bootstrap Baseline.dta", replace
. {c )-}
{txt}
{com}. else if `SeasonFlag' == 1 & `CapFlag' == 0 {c -(}
.         save "C:/Users/Owner/OneDrive/Documents/Georgetown University/Thesis Writer/Research/QB Worth/Season Analysis/Data 26 Season Bootstrap Baseline Pre-2018.dta", replace
. {c )-}
{txt}
{com}. else if `SeasonFlag' == 2 & `CapFlag' == 0 {c -(}
.         save "C:/Users/Owner/OneDrive/Documents/Georgetown University/Thesis Writer/Research/QB Worth/Season Analysis/Data 27 Season Bootstrap Baseline Post-2018.dta", replace
. {c )-}
{txt}
{com}. else if `SeasonFlag' == 0 & `CapFlag' == 2 {c -(}
.         save "C:/Users/Owner/OneDrive/Documents/Georgetown University/Thesis Writer/Research/QB Worth/Season Analysis/Data 28 Season Bootstrap Baseline Sqrt.dta", replace
{txt}{p 0 4 2}
file {bf}
C:/Users/Owner/OneDrive/Documents/Georgetown University/Thesis Writer/Research/QB Worth/Season Analysis/Data 28 Season Bootstrap Baseline Sqrt.dta{rm}
saved
{p_end}
{com}. {c )-}
{txt}
{com}. 
. timer off 1
{txt}
{com}. timer list 1
{res}   1:    626.05 /        1 =     626.0540
{txt}
{com}. display "Runtime: " r(t1)/60 " minutes"
{res}Runtime: 10.434233 minutes
{txt}
{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:/Users/Owner/OneDrive/Documents/Georgetown University/Thesis Writer/Research/QB Worth/Season Analysis/Do 17 Season Bootstrap Baseline Sqrt.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}11 Sep 2025, 13:15:50
{txt}{.-}
{smcl}
{txt}{sf}{ul off}